function y=dmachester(x)
%本函数实现将输入的一段二进制代码编为相应的条件双相码输出
%输入x为二进制码，输出y为编出的条件双相码
t0=100;
t=0:1/t0:length(x);                      %定义对应的时间序列

i=1;                                             %条件双相码的第一个信息元的值需事先假定
if(x(i)==1)                                  %假定输入的第一个信息为1
    for j=1:t0/2
        y(t0/2*(2*i-2)+j)=0;          %前半时间为0
        y(t0/2*(2*i-1)+j)=1;          %后半时间为1
    end
else                                             %反之，输入信息为0
    for j=1:t0/2
        y(t0/2*(2*i-2)+j)=1;          %前半时间为1
        y(t0/2*(2*i-1)+j)=0;          %后半时间为0
    end
end

for i=2:length(x)                     %从第二个信息起编码与前面的码元有关系
    if(x(i)==1)                           %若输入信息为1
        for j=1:t0/2
            y(t0/2*(2*i-2)+j)=y(t0/2*(2*i-3)+t0/4);      %前半时间与前一码元后半时间值相同
            y(t0/2*(2*i-1)+j)=1-(y(t0/2*(2*i-2)+j));      %后半时间值与本码元前半时间值相反
        end
    else
        for j=1:t0/2                  %反之，输入信息为0
           y(t0/2*(2*i-2)+j)=1-y(t0/2*(2*i-3)+t0/4);       %前半时间与前一码元后半时间值相反
           y(t0/2*(2*i-1)+j)=1-(y(t0/2*(2*i-2)+j));        %后半时间值与本码元前半时间值相反
        end
    end
end

y=[y,y(i*t0)];                                                               %给序列y加上最后一位，便于作图
M=max(y);
m=min(y);
subplot(211)
plot(t,y);
axis([0,i,m-0.1,M+0.1]);
grid on;
