function y=miler(x)
%本函数实现将输入的一段二进制代码编为相应的密勒码输出
%输入x为二进制码，输出y为编出的密勒码
t0=100;
t=0:1/t0:length(x);                   %定义对应的时间序列

i=1;                                  %由于第一码元的编码不定，我们直接给出
    if(x(i)==1)                       %若输入信息为1
        for j=1:t0/2
            y(t0/2*(2*i-2)+j)=0;      %定义前半时间值为0
            y(t0/2*(2*i-1)+j)=1;      %定义后半时间值为1
        end
    else
        for j=1:t0/2                    %反之，输入信息为0
           y(t0/2*(2*i-2)+j)=0;         %所有时间为0
           y(t0/2*(2*i-1)+j)=0;
        end
end

    for i=2:length(x)                 %开始进行密勒编码
        if(x(i)==1)                   %输入信息为1
            for j=1:t0/2
                y(t0/2*(2*i-2)+j)=y(t0/2*(2*i-3)+t0/4);
                y(t0/2*(2*i-1)+j)=1-y(t0/2*(2*i-2)+j);
            end
        else
            if(x(i-1)==1)
                for j=1:t0/2
                   y(t0/2*(2*i-2)+j)=y(t0/2*(2*i-3)+t0/4);
                   y(t0/2*(2*i-1)+j)=y(t0/2*(2*i-3)+t0/4);
                end
            else
                for j=1:t0/2
                  y(t0/2*(2*i-2)+j)=1-y(t0/2*(2*i-3)+t0/4);
                  y(t0/2*(2*i-1)+j)=1-y(t0/2*(2*i-3)+t0/4);
                end
            end
        end
end

y=[y,y(i*t0)];                           %给序列y加上最后一位，便于作图
M=max(y);
m=min(y);
subplot(211)
plot(t,y);
axis([0,i,m-0.1,M+0.1]);
grid on;
